import cx from "classnames";

const structure = {
    ua: [
        {
            title: "",
            titleEng: "Dealing with people",
            lessons: (isPortable) => [
                <>
                    <strong>1️⃣ Asking something </strong>
                    <span className={cx({ "font-small": isPortable })}>
                        {
                            " — урок надасть тобі змогу уникнути невпевненості під час формулювання запитань, адже ми розберемо універсальні конструкції, які ти зможеш легко використовувати, щоб задавати питання і колегам і менеджерам"
                        }
                    </span>
                </>,
                <>
                    <strong>2️⃣ Suggestions</strong>
                    <span className={cx({ "font-small": isPortable })}>
                        {
                            " — після уроку ти вмітимеш робити пропозиції корректно і реагувати на них, висувати пропозиції за допомогою вставних слів і вивчиш як по іншому сказати I think"
                        }
                    </span>
                </>,
                <>
                    <strong>3️⃣ Criticism</strong>
                    <span className={cx({ "font-small": isPortable })}>
                        {
                            " — після нашого уроку критикувати стане простіше, адже ми розберемо як обережно вказати людині на недоліки в роботі і заохотити до вдосконалення. Попрактикуємо разом техніку Sandwich і навчимо тебе сприймати критику ввічливо"
                        }
                    </span>
                </>,
                <>
                    <strong>4️⃣ Спікінг клаб</strong>
                    <span className={cx({ "font-small": isPortable })}>
                        {
                            " — 'Role play' - a manager and employee (практика діалогів і критики), обговорення непорозумінь на роботі та способів їх уникнення "
                        }
                    </span>
                </>,
            ],
            description: "",
            emoji: "🤝",
        },
        {
            title: "",
            lessons: (isPortable) => [
                <>
                    <strong>1️⃣ Plans for a new product</strong>
                    <span className={cx({ "font-small": isPortable })}>
                        {
                            " — після уроку ти навчишся будувати плани зі створення продуктів та обговорювати їх з колегами під час мітінгу"
                        }
                    </span>
                </>,
                <>
                    <strong>2️⃣ Changes and how to respond to them </strong>
                    <span className={cx({ "font-small": isPortable })}>
                        {" — зумієш правильно реагувати на зміни в планах і самостійно їх висувати"}
                    </span>
                </>,
                <>
                    <strong>3️⃣ Feedback</strong>
                    <span className={cx({ "font-small": isPortable })}>
                        {
                            " — навчишся надавати фідбек з приводу виконаної роботи та відповідати на фідбек у свою сторону за допомогою граматичних та лексичних конструкцій в англійській"
                        }
                    </span>
                </>,
                <>
                    <strong>4️⃣ Спікінг клаб</strong>
                    <span className={cx({ "font-small": isPortable })}>
                        {
                            " — як змінився світ та ІТ індустрія після появи коронавірусу і які продукти почали з’являтися на ринках "
                        }
                    </span>
                </>,
            ],
            titleEng: "Projects",
            description: "",
            emoji: "⚙️",
        },
        {
            title: "",
            titleEng: "Meetings",
            lessons: (isPortable) => [
                <>
                    <strong>1️⃣ Brainstorming the idea</strong>
                    <span className={cx({ "font-small": isPortable })}>
                        {
                            " — навчишся безконфліктно брейнштормити ідеї англійською та вести дискусії зі своїми колегами"
                        }
                    </span>
                </>,
                <>
                    <strong>2️⃣ Present an idea and report on what you did </strong>
                    <span className={cx({ "font-small": isPortable })}>
                        {
                            " — отримаєш практику в презентуванні власної ідеї перед всім  колективом та навчишся звітувати про свою роботу англійською "
                        }
                    </span>
                </>,
                <>
                    <strong>3️⃣ Dealing with misunderstandings </strong>
                    <span className={cx({ "font-small": isPortable })}>
                        {
                            " — після останнього уроку сміливо розбиратимешся з непорозуміннями в команді і навчишся спілкуватися таким чином, щоб їх уникати"
                        }
                    </span>
                </>,
                <>
                    <strong>4️⃣ Спікінг клаб</strong>
                    <span className={cx({ "font-small": isPortable })}>
                        {
                            " — вирішення спільної проблеми в команді і практика усунення можливих непорозумінь "
                        }
                    </span>
                </>,
            ],
            description: "",
            emoji: "🧑‍💻",
        },
    ],
};

export default structure;
