import React, { useState } from "react";
import { Collapse, List } from "components/index";

import cx from "classnames";

const structure = [
    {
        title: "Часопис англійською",
        titleEng: "Basic tenses",
        lessons: [
            <>
                <strong>Past Simple</strong>
                {
                    " — після уроку ти навчишся правильно розповідати про свій досвід роботи, формулювати речення у минулому швидко і використовувати умовні конструкції"
                }
            </>,
            <>
                <strong>Present Simple</strong>
                {
                    " — під час уроку розберемо чому говорити she don`t та I am agree - не ок, а згодом ти зможеш будувати свої речення в теперішньому часі корректно, розповідати про свої звички та обов’язки на роботі з впевненістю"
                }
            </>,
            <>
                <strong>Future Simple</strong>
                {
                    " — після заняття зможеш говорити про майбутні плані на роботі різного ступеню важливості, про нові проекти, що очікують і правильно використовувати конструкцію to be going to"
                }
            </>,
            <>
                <strong>Спікінг клаб</strong>
                <span>{" — 'Мої плани на майбутнє та історія вибору професії' "}</span>
            </>,
        ],
        description:
            "Базові часи - Past Simple, Present Simple, Future Simple. По уроку на кожний та спікінг клаб в кінці.",
        emoji: "🕑",
    },
    {
        title: "",
        titleEng: "Dealing with people",
        lessons: [
            <>
                <strong>Asking smth </strong>
                {
                    " — урок надасть тобі змогу уникнути невпевненості під час формулювання запитань, адже ми розберемо універсальні конструкції, які ти зможеш легко використовувати, щоб задавати питання і колегам і менеджерам"
                }
            </>,
            <>
                <strong>Suggestions</strong>
                {
                    " — після уроку ти вмітимеш робити пропозиції корректно і реагувати на них, висувати пропозиції за допомогою вставних слів і вивчиш як по іншому сказати I think"
                }
            </>,
            <>
                <strong>Criticism</strong>
                {
                    " — після нашого уроку критикувати стане простіше, адже ми розберемо як обережно вказати людині на недоліки в роботі і заохотити до вдосконалення. Попрактикуємо разом техніку Sandwich і навчимо тебе сприймати критику ввічливо"
                }
            </>,
            <>
                <strong>Спікінг клаб</strong>
                <span>
                    {
                        " — 'Role play' - a manager and employee (практика діалогів і критики), обговорення непорозумінь на роботі та способів їх уникнення "
                    }
                </span>
            </>,
        ],
        description: "",
        emoji: "🤝",
    },
    {
        title: "",
        lessons: [
            <>
                <strong>Plans for a new product</strong>
                {
                    " — після уроку ти навчишся будувати плани зі створення продуктів та обговорювати їх з колегами під час мітінгу"
                }
            </>,
            <>
                <strong>Changes and how to respond to them </strong>
                {" зумієш правильно реагувати на зміни в планах і самостійно їх висувати"}
            </>,
            <>
                <strong>Feedback</strong>
                {
                    " — навчишся надавати фідбек з приводу виконаної роботи та відповідати на фідбек у свою сторону за допомогою граматичних та лексичних конструкцій в англійській"
                }
            </>,
            <>
                <strong>Спікінг клаб</strong>
                <span>
                    {
                        " — як змінився світ та ІТ індустрія після появи коронавірусу і які продукти почали з’являтися на ринках "
                    }
                </span>
            </>,
        ],
        titleEng: "Projects",
        description: "",
        emoji: "⚙️",
    },
    {
        title: "",
        titleEng: "Meetings",
        lessons: [
            <>
                <strong>Brainstorming the idea</strong>
                {
                    " — навчишся безконфліктно брейнштормити ідеї англійською та вести дискусії зі своїми колегами"
                }
            </>,
            <>
                <strong>Present an idea and report on what you did </strong>
                {
                    " — отримаєш практику в презентуванні власної ідеї перед всім  колективом та навчишся звітувати про свою роботу англійською "
                }
            </>,
            <>
                <strong>Dealing with misunderstandings </strong>
                {
                    " — після останнього уроку сміливо розбиратимешся з непорозуміннями в команді і навчишся спілкуватися таким чином, щоб їх уникати"
                }
            </>,
            <>
                <strong>Спікінг клаб</strong>
                <span>
                    {
                        " — вирішення спільної проблеми в команді і практика усунення можливих непорозумінь "
                    }
                </span>
            </>,
        ],
        description: "",
        emoji: "🧑‍💻",
    },
];

export const CourseStructure = ({ className }) => {
    const [openCollapseId, setOpenCollapseId] = useState(1);

    return (
        <div className={className}>
            {structure.map(({ lessons, titleEng, emoji }, index, array) => (
                <Collapse
                    togglerClassName="font-weight-semibold text-left px-3 py-2_5"
                    togglerContent={`${emoji}  ${titleEng}`}
                    className={cx("border border-primary-new border-width-2 rounded-xl", {
                        "mb-3": index + 1 !== array.length,
                    })}
                    contentClassName="px-3 pb-3"
                    hasArrow
                    isControlled
                    isOpen={openCollapseId === index}
                    onToggle={() =>
                        index === openCollapseId
                            ? setOpenCollapseId(null)
                            : setOpenCollapseId(index)
                    }
                    key={emoji}
                >
                    <List list={lessons} type="primary-new" />
                </Collapse>
            ))}
        </div>
    );
};
