import { IMAGES } from "./images";

export const translations = {
    ua: {
        itIntroSection: {
            h1: "Курс “English in IT team”",
            img: {
                src: IMAGES.itCover,
                alt:
                    "Командна робота в IT компанії. Командная работа в IT компании. Корпоративный английский. English in IT team”",
            },
        },
        itRegistrationSection: {
            h2: "Запис на курс",
            img: {
                src: IMAGES.itHero,
                alt: "IT English communication hero",
            },
            form: {
                description:
                    "Залиш свій контакт і Лєра або Влад зателефонують тобі вже сьогодні ввечері 😃",
                afterWord:
                    "Дякуємо, що вирішили займатися з нами ❤️ Чекайте на наш дзвінок після 18-ти вечора.",
            },
        },
        itDetailedInfoSection: {
            h2_1: "Про Курс",
            h2_2: "Що ми для тебе підготувати?",
            h3_1: (
                <>
                    {`Ти вивчив складну мову програмування, але досі погано знаєш англійську? Камон, треба виправляти цю ситуацію. Маємо для тебе рішення 😉`}{" "}
                    <br /> <br />{" "}
                    {`
            Наш курс англійської для IT-спеціалістів — це твоя можливість отримати роботу на міжнародних проеєктах та заробляти у 2-3 рази більше. Тут ти не тільки вивчиш мову, а й навчишся працювати в команді, спілкуватися з клієнтами та забудеш про овертайми. 
            .`}
                </>
            ),
            h2_3: "Автори Курсу",
            h2_4: "Після Курсу Ти Навчишся:",
            h2_5: "FAQ",
            h2_6: "Цей курс для тебе, якщо:",
            matchList: [
                {
                    emoji: "👨‍💻👩‍💻",
                    description:
                        "Ти працюєш у сфері IT програмістом, дизайнером, QA-спеціалістом, менеджером, SEO-спеціалістом, рекрутером або бізнес-аналітиком.",
                },
                {
                    emoji: "🇬🇧🇺🇸",
                    description:
                        "Твій рівень англійської від В1 та вище, але недостатній для вільного спілкування з іноземними партнерами.",
                },
                {
                    emoji: "❤️🚀",
                    description:
                        "Ти любиш свою справу, та хочеш вийти на міжнародний ринок та працювати на крутих проектах.",
                },
                {
                    emoji: "📄😤",
                    description:
                        "Ти часто стикаєшся с технічними документами, але не завжди можеш прочитати їх без перекладача.",
                },
            ],
            authorsList: [
                {
                    name: "Марта Чайковська",
                    role: "Автор та Вчитель курсу",
                    description:
                        "Хай, я твій ментор на цьому курсі. За рік роботи у wannablab я провела понад 1500 занять та вивела більш ніж 70 учнів зі ступору англійської мови. Будеш наступним?",
                    img: {
                        src: IMAGES.martaItAvatar,
                        alt:
                            "Марта Чайковська - головний вчитель, автор програми курсу 'Англійська комунікація в IT команді'",
                    },
                    inst: "https://www.instagram.com/marta_chaykovskaya/",
                    isBig: true,
                },
                {
                    name: "Влад Балюк",
                    role: "Організатор Курсів",
                    description:
                        "Здоровки :) Разом з Мартою я збирав проблеми, з якими ти можеш стикнутися в інтернаціональних IT командах, і допомагав знайти їх рішення. Сам в IT вже понад 5 років, з яких півтора провів в інтернаціональних командах.",
                    img: {
                        src: IMAGES.vladItAvatar,
                        alt: "Влад Балюк - організатор курсу 'Англійська комунікація в IT команді'",
                    },
                    inst: "https://www.instagram.com/vlad_lem_/",
                },
                {
                    name: "Лєра Михальова",
                    role: "Організатор Курсів",
                    description:
                        "Привіт! Я організатор цього курсу і вже понад рік працюю у шведській компанії, як розробник. Від мене ти отримаєш корисні скіли для роботи в команді та допомогу в організаційних питаннях.",
                    img: {
                        src: IMAGES.leraItAvatar,
                        alt:
                            "Велерія Михальова - організатор курсу 'Англійська комунікація в IT команді'",
                    },
                    inst: "https://www.instagram.com/mykhalove/",
                },
            ],
            valuesList: [
                {
                    title: `Прокачаєш свої soft skills`,
                    description:
                        "Навчишся критично мислити, швидко приймати рішення та розв'язувати проблеми. І все для того, щоб рости у своїй професії, стати senior developers, тім-лідом або створити власну компанію",
                },
                {
                    title: "Забудеш про овертайми",
                    description:
                        "Коли у тебе погана комунікація з тім-лідами, менеджерами або замовниками, ти нераціонально витрачаєш свій час. З нами ти забудеш, що таке овертайми.",
                },
                {
                    title: "Станеш командним гравцем",
                    description:
                        "Разом працювати легше: у тебе буде наставник та чувак, який розкаже жарт у важку хвилину. Але треба вміти спілкуватися з teammates та бути up-to-date зі всім, що відбувається. Тож ми розкажемо про трудову етику, лідерство і навчимо виходити з конфліктних ситуацій.",
                },
                {
                    title: "Зможеш працювати з іноземними клієнтами",
                    description:
                        "Якщо робота в офісі — не твій варіант, тоді навчися самостійно комунікувати з замовниками, щоб не червоніти на спільних мітінгах. Сорі, але без англійської тут не обійтися.",
                },
                {
                    title: "Подивишся на критику з іншого боку",
                    description:
                        "Конструктивна критика від замовників — це нормально. Ти будеш часто чути її від іноземних замовників або свого тім-ліда. На курсі ти навчишся сприймати критику без емоцій та сліз, або доводити свою точку зору без істерик.",
                },
            ],
            faqList: [
                {
                    title: "Як проходить курс?",
                    description:
                        "Весь курс проходить онлайн. В закритому Телеграм-чаті ми будемо ділитися мемчиками, домашніми завданнями та важливою інформацією щодо занять. Уроки будуть проходити на платформі Google Meet, тож встанови її на телефон або ноутбук завчасно.",
                },
                {
                    title: "Скільки у мене буде classmates?",
                    description:
                        "В групі буде до 4-х людей. Ми набираємо невелику компанію, щоб Марта приділяла час кожному. Тож без уваги ти точно не залишишся.",
                },
                {
                    title: "А якщо я пропущу заняття? Я можу його відпрацювати?",
                    description:
                        "Через те, що заняття мають послідовну програму, відпрацювати його не можна. Але ти можеш переглянути усі онлайн-матеріали пропущеного заняття самостійно і написати Марті, якщо в тебе виникнуть питання.",
                },
                {
                    title: "У мене будуть домашні завдання?",
                    description:
                        "Так, після кожного уроку ти отримуватимеш домашку від Марти. Ми не примушуємо її виконувати — це твій вибір. Але найкращі студенти отримають безкоштовне місце на спікінг клабі з американцем.",
                },
                {
                    title: "А якщо мені не сподобається?",
                    description:
                        "Ми сподіваємось, що такого не станеться. Але у разі чого, упродовж тижня ти зможеш покинути курси та повернути кошти за невідвідані заняття.",
                },
            ],
        },
    },
};
