import kateAvatar from "assets/images/kate_avatar.jpeg";
import marynaAvatar from "assets/images/maryna_avatar.webp";
import martaItAvatar from "assets/images/marta_it_avatar.jpeg";

const mentorsList = [
    {
        slug: "marta-yarosh",
        name: "Марта Чайковська",
        src: martaItAvatar,
        list: ["IELTS (7.5 CERF C1)", "50+ успішних студентів"],
        color: "light-green",
        shortDescription: "Вчитель англійської мови для дорослих починаючи від рівня А2 до С1.",
        longDescription:
            'Знання підтверджені міжнародним сертифікатом IELTS (7.5 CERF C1) \nЗа рік роботи вчителем у wannablab допомогла більше 30 студентам позбавитися мовного бар\'єру та перестати нарешті говорити "I am agree". \n Маю досвід в підготовці студентів до таких екзаменів як ЄВІ, ЗНО, IELTS.',
        instaHref: "https://www.instagram.com/p/CKQ3toJnQRk/",
    },
    {
        slug: "kate-timchenko",
        name: "Катя Тимченко",
        src: kateAvatar,
        list: ["3+ роки практики", "1500+ уроків"],
        shortDescription: "Репетитор англійської мови для дорослих та дітей.",
        longDescription:
            "Мене звати Катя, я викладаю англійську з 18 років і готова поділитись усіма знаннями, які накопичила за ці роки. Можу підтримати розмову на будь-яку тему - від бізнес-новин до моди та серіалів.",
        color: "soft-purple",
        instaHref: "https://www.instagram.com/p/CLMI-SRnLwM/",
    },
    {
        slug: "marina-torokhtiy",
        name: "Марина Торохтій",
        src: marynaAvatar,
        shortDescription: "Вчитель яка знає 6 мов  та пожила вже у чотирьох країнах!",
        longDescription:
            "Привіт, я Марина, думаєш говорити англійською страшно? Тоді мої смол токи саме для тебе, це буде ізі & фані адже я маю безліч досвіду в спілкуванні з іноземцями, чого і тебе навчу😊 Жила в Португалії, в Канаді та наразі в Німеччині.",
        list: ["native speaker", "500+ проведених уроків"],
        color: "soft-purple",
        instaHref: "https://www.instagram.com/p/CLoWqlBHXQv/",
    },
];

export default mentorsList;
