const translations = {
    ua: {
        info: [
            {
                label: "🏃‍♂️ Старт",
                value: "27 липня",
            },
            {
                label: "⏳ Тривалість",
                value: "2 місяці (16 уроків)",
            },
            {
                label: "📅 Розклад",
                value: "вівторок i четвер 18:15–19:15",
            },
            {
                label: "💳 Вартість",
                value: "4 970",
                newValue: "3970 грн",
            },
        ],
        actionButtonLabel: "Записатися ⬇️",
    },
};

export default translations;
