const translations = {
    ua: {
        info: [
            {
                label: "🏃‍♂️ Старт",
                value: "12 серпня",
            },
            {
                label: "⏳ Тривалість",
                value: "1,5 місяці (12 уроків)",
            },
            {
                label: "📅 Розклад",
                value: "вівторок i четвер 18:15–19:15",
            },
            {
                label: "💳 Вартість",
                value: "3 970 грн",
            },
        ],
        actionButtonLabel: "Записатися ⬇️",
    },
};

export default translations;
